**If i install the chart via the helm cli**

```
 helm install aws-load-balancer-controller eks/aws-load-balancer-controller -n kube-system --set clusterName=geeiq-test-k8s --set serviceAccount.create=false --set serviceAccount.name=aws-load-balancer-controller
 ```
 
 It installs successfully now
 
 ```
 
NAME: aws-load-balancer-controller
LAST DEPLOYED: Thu Apr 28 09:36:35 2022
NAMESPACE: kube-system
STATUS: deployed
REVISION: 1
TEST SUITE: None
NOTES:
AWS Load Balancer controller installed!
```

**But via terraform it does...**

```
resource "helm_release" "aws_load_balancer_controller" {
  name = "aws-load-balancer-controller"

  repository = "https://aws.github.io/eks-charts"
  chart      = "aws-load-balancer-controller"
  namespace  = local.k8s_aws_lb_service_account_namespace

  set {
    name  = "clusterName"
    value = data.terraform_remote_state.eks.outputs.cluster_id
  }

  set {
    name  = "rbac.serviceAccount.create"
    value = false
  }

  set {
    name  = "rbac.serviceAccount.name"
    value = local.k8s_aws_lb_service_account_name
  }

  set {
    name  = "nodeSelector.geeiq/node-type"
    value = "worker"
  }

  depends_on = [
    kubernetes_service_account.aws_load_balancer_controller,
    aws_iam_policy.aws_loadbalancer_controller
  ]

}
```

```
Terraform will perform the following actions:

  # helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "geeiq-test-k8s"
        }
      + set {
          + name  = "nodeSelector.geeiq/node-type"
          + value = "worker"
        }
      + set {
          + name  = "rbac.serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + helm_release_aws_load_balancer_controller = (sensitive value)

Do you want to perform these actions in workspace "test"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

helm_release.aws_load_balancer_controller: Creating...
╷
│ Error: rendered manifests contain a resource that already exists. Unable to continue with install: ServiceAccount "aws-load-balancer-controller" in namespace "kube-system" exists and cannot be imported into the current release: invalid ownership metadata; label validation error: missing key "app.kubernetes.io/managed-by": must be set to "Helm"; annotation validation error: missing key "meta.helm.sh/release-name": must be set to "aws-load-balancer-controller"; annotation validation error: missing key "meta.helm.sh/release-namespace": must be set to "kube-system"
│
│   with helm_release.aws_load_balancer_controller,
│   on loadbalancer_controller.tf line 50, in resource "helm_release" "aws_load_balancer_controller":
│   50: resource "helm_release" "aws_load_balancer_controller" {
│
```

Im using the same value for the variables...